codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512efk124.h
#define _IPC12_ADCDC5IS_POSITION                 0x00000010
#define _IPC12_ADCDC5IS_MASK                     0x00030000
#define _IPC12_ADCDC5IS_LENGTH                   0x00000002

#define _IPC12_ADCDC5IP_POSITION                 0x00000012
#define _IPC12_ADCDC5IP_MASK                     0x001C0000
#define _IPC12_ADCDC5IP_LENGTH                   0x00000003

#define _IPC12_ADCDC6IS_POSITION                 0x00000018
#define _IPC12_ADCDC6IS_MASK                     0x03000000
#define _IPC12_ADCDC6IS_LENGTH                   0x00000002

#define _IPC12_ADCDC6IP_POSITION                 0x0000001A
#define _IPC12_ADCDC6IP_MASK                     0x1C000000
#define _IPC12_ADCDC6IP_LENGTH                   0x00000003

#define _IPC12_w_POSITION                        0x00000000
#define _IPC12_w_MASK                            0xFFFFFFFF
#define _IPC12_w_LENGTH                          0x00000020

#define _IPC13_ADCDF1IS_POSITION                 0x00000000
#define _IPC13_ADCDF1IS_MASK                     0x00000003
#define _IPC13_ADCDF1IS_LENGTH                   0x00000002

#define _IPC13_ADCDF1IP_POSITION                 0x00000002
#define _IPC13_ADCDF1IP_MASK                     0x0000001C
#define _IPC13_ADCDF1IP_LENGTH                   0x00000003

#define _IPC13_ADCDF2IS_POSITION                 0x00000008
#define _IPC13_ADCDF2IS_MASK                     0x00000300
#define _IPC13_ADCDF2IS_LENGTH                   0x00000002

#define _IPC13_ADCDF2IP_POSITION                 0x0000000A
#define _IPC13_ADCDF2IP_MASK                     0x00001C00
#define _IPC13_ADCDF2IP_LENGTH                   0x00000003

#define _IPC13_ADCDF3IS_POSITION                 0x00000010
#define _IPC13_ADCDF3IS_MASK                     0x00030000
#define _IPC13_ADCDF3IS_LENGTH                   0x00000002

#define _IPC13_ADCDF3IP_POSITION                 0x00000012
#define _IPC13_ADCDF3IP_MASK                     0x001C0000
#define _IPC13_ADCDF3IP_LENGTH                   0x00000003

#define _IPC13_ADCDF4IS_POSITION                 0x00000018
#define _IPC13_ADCDF4IS_MASK                     0x03000000
#define _IPC13_ADCDF4IS_LENGTH                   0x00000002

#define _IPC13_ADCDF4IP_POSITION                 0x0000001A
#define _IPC13_ADCDF4IP_MASK                     0x1C000000
#define _IPC13_ADCDF4IP_LENGTH                   0x00000003

#define _IPC13_w_POSITION                        0x00000000
#define _IPC13_w_MASK                            0xFFFFFFFF
#define _IPC13_w_LENGTH                          0x00000020

#define _IPC14_ADCDF5IS_POSITION                 0x00000000
#define _IPC14_ADCDF5IS_MASK                     0x00000003
#define _IPC14_ADCDF5IS_LENGTH                   0x00000002

#define _IPC14_ADCDF5IP_POSITION                 0x00000002
#define _IPC14_ADCDF5IP_MASK                     0x0000001C
#define _IPC14_ADCDF5IP_LENGTH                   0x00000003

#define _IPC14_ADCDF6IS_POSITION                 0x00000008
#define _IPC14_ADCDF6IS_MASK                     0x00000300
#define _IPC14_ADCDF6IS_LENGTH                   0x00000002

#define _IPC14_ADCDF6IP_POSITION                 0x0000000A
#define _IPC14_ADCDF6IP_MASK                     0x00001C00
#define _IPC14_ADCDF6IP_LENGTH                   0x00000003

#define _IPC14_ADCFLTIS_POSITION                 0x00000010
#define _IPC14_ADCFLTIS_MASK                     0x00030000
#define _IPC14_ADCFLTIS_LENGTH                   0x00000002

#define _IPC14_ADCFLTIP_POSITION                 0x00000012
#define _IPC14_ADCFLTIP_MASK                     0x001C0000
#define _IPC14_ADCFLTIP_LENGTH                   0x00000003

#define _IPC14_ADCD0IS_POSITION                  0x00000018
#define _IPC14_ADCD0IS_MASK                      0x03000000
#define _IPC14_ADCD0IS_LENGTH                    0x00000002

#define _IPC14_ADCD0IP_POSITION                  0x0000001A
#define _IPC14_ADCD0IP_MASK                      0x1C000000
#define _IPC14_ADCD0IP_LENGTH                    0x00000003

#define _IPC14_w_POSITION                        0x00000000
#define _IPC14_w_MASK                            0xFFFFFFFF
#define _IPC14_w_LENGTH                          0x00000020

#define _IPC15_ADCD1IS_POSITION                  0x00000000
#define _IPC15_ADCD1IS_MASK                      0x00000003
#define _IPC15_ADCD1IS_LENGTH                    0x00000002

#define _IPC15_ADCD1IP_POSITION                  0x00000002
#define _IPC15_ADCD1IP_MASK                      0x0000001C
#define _IPC15_ADCD1IP_LENGTH                    0x00000003

#define _IPC15_ADCD2IS_POSITION                  0x00000008
#define _IPC15_ADCD2IS_MASK                      0x00000300
#define _IPC15_ADCD2IS_LENGTH                    0x00000002

#define _IPC15_ADCD2IP_POSITION                  0x0000000A
#define _IPC15_ADCD2IP_MASK                      0x00001C00
#define _IPC15_ADCD2IP_LENGTH                    0x00000003

#define _IPC15_ADCD3IS_POSITION                  0x00000010
#define _IPC15_ADCD3IS_MASK                      0x00030000
#define _IPC15_ADCD3IS_LENGTH                    0x00000002

#define _IPC15_ADCD3IP_POSITION                  0x00000012
#define _IPC15_ADCD3IP_MASK                      0x001C0000
#define _IPC15_ADCD3IP_LENGTH                    0x00000003

#define _IPC15_ADCD4IS_POSITION                  0x00000018
#define _IPC15_ADCD4IS_MASK                      0x03000000
#define _IPC15_ADCD4IS_LENGTH                    0x00000002

#define _IPC15_ADCD4IP_POSITION                  0x0000001A
#define _IPC15_ADCD4IP_MASK                      0x1C000000
#define _IPC15_ADCD4IP_LENGTH                    0x00000003

#define _IPC15_w_POSITION                        0x00000000
#define _IPC15_w_MASK                            0xFFFFFFFF
#define _IPC15_w_LENGTH                          0x00000020

#define _IPC16_ADCD5IS_POSITION                  0x00000000
#define _IPC16_ADCD5IS_MASK                      0x00000003
#define _IPC16_ADCD5IS_LENGTH                    0x00000002

#define _IPC16_ADCD5IP_POSITION                  0x00000002
#define _IPC16_ADCD5IP_MASK                      0x0000001C
#define _IPC16_ADCD5IP_LENGTH                    0x00000003

#define _IPC16_ADCD6IS_POSITION                  0x00000008
#define _IPC16_ADCD6IS_MASK                      0x00000300
#define _IPC16_ADCD6IS_LENGTH                    0x00000002

